[
  {
    "path": "posts/2022-03-08-introduction-to-git-and-github/",
    "title": "Introduction to Git and GitHub",
    "description": "Version control software such as Git is essential for collaboration and version\ntracking on data science projects, however the learning curve for Git is quite steep. In this\nworkshop we will introduce and practice common workflows using Git and GitHub.",
    "author": [
      {
        "name": "Benjamin Soltoff",
        "url": "https://www.bensoltoff.com"
      }
    ],
    "date": "2022-03-08",
    "categories": [],
    "contents": "\nOverview\nGit is a common tool in software\ndevelopment for version control, while GitHub is a cloud-based service that\nworks in conjunction with the Git software to facilitate version control\nand collaboration. These tools can be used to improve data science\nworkflows and computationally-enhanced research projects. However the\nlearning curve for Git is quite steep, and often individuals are left to\nlearn Git on their own with little explicit instruction. In this\nworkshop we will introduce Git/GitHub and practice common workflows.\nObjectives\nIdentify the value of version control software for data science\nprojects\nCreate repositories\nMake commits and synchronize repositories\nImplement collaborative workflows using branches and forks\nGenerate pull requests\nAudience\nThis workshop is designed for individuals with\nintroductory-to-intermediate experience programming in a language such\nas Python or R.\nLocation\nRoom 295 in 1155 E\n60th St.\nPrework\nOn the day of the workshop, please plan to work from a laptop that\nhas the following installed:\nA recent version of R (>=4.1.0), which is available for free\nat https://cloud.r-project.org/\nThe most recent version of the RStudio Desktop Integrated\nDevelopment Environment (IDE version 2022.02.0+443), available for free\n(RStudio\nDesktop Open Source License).\nThe R packages we will use, which you can install by connecting\nto the internet, opening RStudio, and running at the command line:\ninstall.packages(c(\"usethis\", \"gitcreds\", \"gh\"))\nRestart your R session before using any newly installed\npackages\nWe will be using GitHub in this workshop for version control and\npublishing. Sign up for a free GitHub.com account at https://github.com/join\nif you don’t already have one.\nAdditional resources\nHappy Git and GitHub for\nthe useR by Jenny Bryan, the STAT 545 TAs, and Jim Hester - a\ncomprehensive guide to “git”-ing started with Git, GitHub, and\nR/RStudio\n\n\n\n\n",
    "preview": {},
    "last_modified": "2022-03-04T15:00:43-06:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-02-25-introduce-yourself-online/",
    "title": "Introduce yourself online",
    "description": "A professional web presence is a great way to share information about\nyourself on the internet. In this workshop we will learn how to build\na few different types of websites using R and R Markdown.",
    "author": [
      {
        "name": "Benjamin Soltoff",
        "url": "https://www.bensoltoff.com"
      }
    ],
    "date": "2022-02-25",
    "categories": [],
    "contents": "\nOverview\nA professional website is a great way to share information about yourself and your projects on the internet. However creating a website can seem daunting if you have never worked with HTML, CSS, or Javascript. In this workshop we will learn how to build websites using R, RStudio, and R Markdown.\nObjectives\nIdentify the value of an online presence\nCreate a basic GitHub profile\nGenerate an “about” page using postcards and publish it with GitHub Pages\nCreate a Markdown-based website using Hugo and blogdown\nPublish a version-controlled website on GitHub using Netlify\nAudience\nThis workshop is designed for individuals who use R on a regular basis for data analysis. Prior experience with Git and GitHub is preferred but not essential.\nLocation\nNote: This workshop meets on a special date and time (Friday February 25th from 9:30-12:20pm)!\nRoom 295 in 1155 E 60th St.\nPrework\nRegister for this workshop. Due to the current public health crisis, all participants must register in advance using this form.\nComplete the prework steps described here.\nLinks\nWorkshop materials\n\n\n\n",
    "preview": {},
    "last_modified": "2022-02-22T15:43:06-06:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-02-15-interpretable-machine-learning-methods/",
    "title": "Interpreting and explaining machine learning models",
    "description": "Machine learning algorithms are widely used in data science applications and have significant potential to improve predictions and understanding of social scientific processes. In many applications researchers need to be able to explain why the model made one prediction over another. In this workshop we introduce several techniques for interpreting black box models using model-agnostic techniques.",
    "author": [
      {
        "name": "Benjamin Soltoff",
        "url": "https://www.bensoltoff.com"
      }
    ],
    "date": "2022-02-15",
    "categories": [],
    "contents": "\nOverview\nMachine learning algorithms are widely used in data science applications and have significant potential to improve predictions and understanding of social scientific processes. However machine learning models generally do not explain their predictions – they simply seek to minimize some loss function and provide for a given observation the probability of an event occurring. In many applications researchers need to be able to explain why the model made one prediction over another. This emphasis on interpretability and explanation is directly relevant to many social scientific questions, and can provide necessary context for decision makers who need to use machine learning models but lack a strong technical background. In this workshop we introduce several techniques for interpreting black box models using model-agnostic techniques.\nObjectives\nDefine interpretation and explanation, and their importance to machine learning\nIdentify model-agnostic methods for creating interpretations/explanations\nImplement techniques for creating global model-agnostic explanations in R\nImplement techniques for creating local model-agnostic explanations in R\nAudience\nThis workshop is designed for individuals with introductory-to-intermediate knowledge of machine learning algorithms, as well as experience training machine learning models using R. Prior experience with tidymodels is helpful, but not required.\nLocation\nRoom 295 in 1155 E 60th St.\nPrework\nRegister for this workshop. Due to the current public health crisis, all participants must register in advance using this form.\nPlease sign up for a free RStudio Cloud account.\nOnce you have created your RStudio Cloud account, join the workshop organization.\nLinks\nSlides\nSource materials for the workshop on GitHub\nAdditional Resources\nExplanatory Model Analysis by Przemyslaw Biecek and Tomasz Burzykowski - a book written by the co-authors of DALEX which outlines the intuition and methodology of many of the interpretation/explanation methods we discuss in the workshop. Also includes code examples in R and Python.\nInterpretable Machine Learning by Christoph Molnar - another textbook on interpretability and explanation in machine learning. Written by the author of iml, an alternative package for interpreting and explaining models in R using model-agnostic methods.\nMaksymiuk, S., Gosiewska, A., & Biecek, P. (2020). Landscape of R packages for eXplainable Artificial Intelligence. arXiv preprint arXiv:2009.13248. - an exhaustive survey of all known R packages which implement eXplainable Artificial Intelligence (XAI).\nExplaining models and predictions, in Tidy Modeling with R by Max Kuhn and Julia Silge - a book chapter demonstrating how to integrate model explanations into the tidymodels workflow.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2022-02-15T10:46:00-06:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-01-25-introduction-to-r-for-the-python-user/",
    "title": "Introduction to R for the Python user",
    "description": "A quick-start guide for Python users to get up to speed with the R programming language.",
    "author": [
      {
        "name": "Benjamin Soltoff",
        "url": "https://www.bensoltoff.com"
      }
    ],
    "date": "2022-01-25",
    "categories": [],
    "contents": "\nOverview\nPython and R are two of the dominant programming languages used in data science. Python has strong demand within industry, while in many academic fields R is the preferred language. While the flame wars between Python and R users continue to rage, many leading software developers and data science practitioners urge users to learn how to leverage both languages depending on each software’s natural strengths.1 This workshop is designed for Python users who want to learn how to use R in their work.\nObjectives\nReview the origins of the R programming language.\nIdentify the basic elements of R\nDistinguish equivalent operations in R from Python\nIntroduce a common set of packages for data analysis in R\nAudience\nThis workshop is designed for individuals with intermediate-to-advanced training and/or experience in Python (e.g. MACS 30121 and beyond) who have never used R before. Especially useful if you are taking a course which requires you to complete assignments using R.\nLocation\nRoom 295 in 1155 E 60th St.\nPrework\nRegister for this workshop. Due to the current public health crisis, all participants must register in advance using this form.\nPlease sign up for a free RStudio Cloud account.\nOnce you have created your RStudio Cloud account, join the workshop organization.\nLinks\nSlides\nSource materials for the workshop on GitHub\nAdditional Resources\nR for Data Engineers: A Brief Introduction for People Who Count From Zero by Greg Wilson\nR for Data Science by Hadley Wickham and Garrett Grolemund\nAdvanced R by Hadley Wickham\nR for Data Science Online Learning Community\n#TidyTuesday\nAcknowledgments\nThis workshop is derived in part from R for Data Engineers: A Brief Introduction for People Who Count From Zero by Greg Wilson and is licensed under the Creative Commons Attribution 4.0 International license (CC-BY-4.0).\n\n\nConsider this illuminating interview with Hadley Wickham, Chief Scientist at RStudio and an Adjunct Professor of Statistics at the University of Auckland, Stanford University, and Rice University.↩︎\n",
    "preview": {},
    "last_modified": "2022-01-25T10:49:17-06:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-11-16-literate-programming-with-r-markdown/",
    "title": "Literate programming with R Markdown",
    "description": "Literate programming is a technique for meshing source code with a human-readable explanation of its\nlogic. This approach is used widely in data science and the social sciences to enable\nreproducible research and open access. In this workshop, we introduce the R Markdown document format\nand practice developing notebooks interweaving source code, output, and written text.",
    "author": [
      {
        "name": "Benjamin Soltoff",
        "url": "https://www.bensoltoff.com"
      }
    ],
    "date": "2021-11-16",
    "categories": [],
    "contents": "\nOverview\nLiterate programming is a technique for meshing source code with a human-readable explanation of its logic. This approach is used widely in data science and the social sciences to enable reproducible research and open access. In this workshop, we introduce rmarkdown and the R Markdown document format, and practice developing notebooks interweaving source code, output, and written text.\nObjectives\nReview the importance of reproducibility in scientific research\nIdentify the major components of R Markdown documents\nPractice writing Markdown formatted text\nDefine knitr chunks\nImplement chunk options to customize output\nCreate different R Markdown document formats\nDistinguish R Markdown documents from R Markdown notebooks\nDistinguish between R scripts (.R) and R Markdown documents (.Rmd)\nAudience\nThis workshop is designed for individuals with a basic familiarity using R for data analysis.\nLocation\nRoom 295 in 1155 E 60th St.\nPrework\nRegister for this workshop. Due to the current public health crisis, all participants must register in advance using this form.\nPlease sign up for a free RStudio Cloud account.\nIf you have not participated in a previous workshop meeting, join the workshop organization.\nLinks\nSlides\nSource materials for the workshop on GitHub\n\n\n\n",
    "preview": {},
    "last_modified": "2021-11-12T13:23:25-06:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-11-02-optimizing-selection-of-color-palettes/",
    "title": "Optimizing selection of color palettes",
    "description": "Researchers frequently use color to communicate numeric values in a data visualization.\nMost software will implement a default algorithm to select a color palette, and these\npalettes frequently are hard-to-interpret or are inaccessible to individuals with vision\nimpairments. In this workshop we will develop approaches to readily generate optimized\ncolor palettes for continuous and categorical variables.",
    "author": [
      {
        "name": "Benjamin Soltoff",
        "url": "https://www.bensoltoff.com"
      }
    ],
    "date": "2021-11-02",
    "categories": [],
    "contents": "\nOverview\nResearchers frequently use color to communicate numeric values in a data visualization. Most software will implement a default algorithm to select a color palette, and these palettes frequently are hard-to-interpret or are inaccessible to individuals with vision impairments. In this workshop we will develop approaches to readily generate optimized color palettes for continuous and categorical variables.\nObjectives\nIdentify when color is used to visualize data\nDistinguish between hue palettes and gradients\nDemonstrate the importance of selecting appropriate palettes/gradients for interpretation and accessibility\nEvaluate use cases for quantitative vs. qualitative color scales\nEvaluate use cases for sequential vs. diverging color scales\nEvaluate use cases for discrete vs. continuous color scales\nConsider how to interpolate values to colors\nImplement ready-to-use optimized color scales using ggplot2 and existing R packages\nAudience\nThis workshop is designed for individuals with a basic familiarity using R and ggplot2 for data visualization.\nLocation\nRoom 295 in 1155 E 60th St.\nPrework\nRegister for this workshop. Due to the current public health crisis, all participants must register in advance using this form.\nPlease sign up for a free RStudio Cloud account.\nIf you have not participated in a previous workshop meeting, join the workshop organization.\nLinks\nSlides\nSource materials for the workshop on GitHub\nAcknowledgments\nOverview of color palettes drawn from “Which color scale to use when visualizing data” by Lisa Charlotte Muth\n\n\n\n",
    "preview": {},
    "last_modified": "2021-11-02T14:49:28-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-10-19-geospatial-visualizations-with-r/",
    "title": "Geospatial visualizations with R",
    "description": "R contains many different packages for importing, structuring, and visualizing geospatial datasets.\nIn this workshop we will consider two workflows for drawing geospatial data visualizations (aka data maps)\nusing pre-generated mapping tiles as well as spatial vector datasets. These methods integrate\ndirectly into tidy workflows and visualization methods such as `ggplot2`.",
    "author": [
      {
        "name": "Benjamin Soltoff",
        "url": "https://www.bensoltoff.com"
      }
    ],
    "date": "2021-10-19",
    "categories": [],
    "contents": "\nOverview\nR contains many different packages for importing, structuring, and visualizing geospatial datasets. In this workshop we will consider two workflows for drawing geospatial data visualizations (aka data maps). In the first method we will obtain pre-generated mapping tiles from sources such as Stamen Maps using the ggmap package. With the second method, we will use spatial data files which contain detailed information to draw all the components of a map (e.g. points, lines, polygons) using the simple features framework and the sf package. These methods integrate directly into tidy workflows and visualization methods such as ggplot2.\nObjectives\nIntroduce the major components of a geospatial visualization\nIdentify how to obtain map tiles using ggmap and get_map()\nGenerate plots overlaying data on raster map tiles\nDefine common data structures for storing spatial data objects\nImport spatial data using the sf package\nDraw maps using ggplot2 and geom_sf()\nChange coordinate systems\nAudience\nThis workshop is designed for individuals with a basic familiarity using R and ggplot2 for data visualization.\nLocation\nRoom 295 in 1155 E 60th St.\nPrework\nRegister for this workshop. Due to the current public health crisis, all participants must register in advance using this form.\nPlease sign up for a free RStudio Cloud account.\nIf you have not participated in a previous workshop meeting, join the workshop organization.\nLinks\nSource materials for the workshop on GitHub\nTo download these materials to your local computer, use the code below:\nusethis::use_course(\"css-skills/geospatial-viz\")\n\n\n\n",
    "preview": {},
    "last_modified": "2021-11-02T14:49:03-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-10-05-data-visualization-with-ggplot2/",
    "title": "Data visualization with ggplot2",
    "description": "An introduction to data visualization and the grammar of graphics in R.",
    "author": [
      {
        "name": "Benjamin Soltoff",
        "url": "https://www.bensoltoff.com"
      }
    ],
    "date": "2021-10-05",
    "categories": [],
    "contents": "\nData visualization with ggplot2\nOverview\nData visualizations are an important tool for communicating scientific findings. Visualizations encode empirical data in a compact and efficient form to help tell a story using your data. This workshop provides an introduction to creating statistical graphics using R and the ggplot2 package.\nObjectives\nProduce scatter plots, boxplots, and barplots using ggplot2\nOverlay multiple plot types on a single graph\nSet universal plot settings\nDescribe faceting (or small multiples plots) and apply faceting in ggplot2\nModify the aesthetics of an existing ggplot() plot\nBuild complex and customized plots from data in a data frame\nAudience\nThis workshop is designed for individuals with a basic familiarity using R and programmatic tools to conduct data analysis.\nLocation\nRoom 295 in 1155 E 60th St.\nPrework\nRegister for this workshop. Due to the current public health crisis, all participants must register in advance using this form.\nPlease sign up for a free RStudio Cloud account.\nOnce you have created your RStudio Cloud account, join the workshop organization.\nLinks\nSource materials for the workshop on GitHub\nTo download these materials to your local computer, use the code below:\nusethis::use_course(\"css-skills/dataviz\")\nAcknowledgments\nWorkshop materials are derived from R for Social Scientists licensed under Attribution 4.0 International (CC BY 4.0).\n\n\n\n",
    "preview": {},
    "last_modified": "2021-11-02T14:49:08-05:00",
    "input_file": {}
  }
]
