[
  {
    "path": "posts/2021-11-16-literate-programming-with-r-markdown/",
    "title": "Literate programming with R Markdown",
    "description": "Literate programming is a technique for meshing source code with a human-readable explanation of its\nlogic. This approach is used widely in data science and the social sciences to enable\nreproducible research and open access. In this workshop, we introduce the R Markdown document format\nand practice developing notebooks interweaving source code, output, and written text.",
    "author": [
      {
        "name": "Benjamin Soltoff",
        "url": "https://www.bensoltoff.com"
      }
    ],
    "date": "2021-11-16",
    "categories": [],
    "contents": "\nOverview\nLocation\nRoom 295 in 1155 E 60th St.\nPrework\nRegister for this workshop. Due to the current public health crisis, all participants must register in advance using this form. Link to be posted.\nPlease sign up for a free RStudio Cloud account.\nLinks\nRStudio Cloud workspace\nSource materials for the workshop on GitHub\n\n\n\n",
    "preview": {},
    "last_modified": "2021-11-02T14:48:56-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-11-02-optimizing-selection-of-color-palettes/",
    "title": "Optimizing selection of color palettes",
    "description": "Researchers frequently use color to communicate numeric values in a data visualization.\nMost software will implement a default algorithm to select a color palette, and these\npalettes frequently are hard-to-interpret or are inaccessible to individuals with vision\nimpairments. In this workshop we will develop approaches to readily generate optimized\ncolor palettes for continuous and categorical variables.",
    "author": [
      {
        "name": "Benjamin Soltoff",
        "url": "https://www.bensoltoff.com"
      }
    ],
    "date": "2021-11-02",
    "categories": [],
    "contents": "\nOverview\nResearchers frequently use color to communicate numeric values in a data visualization. Most software will implement a default algorithm to select a color palette, and these palettes frequently are hard-to-interpret or are inaccessible to individuals with vision impairments. In this workshop we will develop approaches to readily generate optimized color palettes for continuous and categorical variables.\nObjectives\nIdentify when color is used to visualize data\nDistinguish between hue palettes and gradients\nDemonstrate the importance of selecting appropriate palettes/gradients for interpretation and accessibility\nEvaluate use cases for quantitative vs. qualitative color scales\nEvaluate use cases for sequential vs. diverging color scales\nEvaluate use cases for discrete vs. continuous color scales\nConsider how to interpolate values to colors\nImplement ready-to-use optimized color scales using ggplot2 and existing R packages\nAudience\nThis workshop is designed for individuals with a basic familiarity using R and ggplot2 for data visualization.\nLocation\nRoom 295 in 1155 E 60th St.\nPrework\nRegister for this workshop. Due to the current public health crisis, all participants must register in advance using this form.\nPlease sign up for a free RStudio Cloud account.\nIf you have not participated in a previous workshop meeting, join the workshop organization.\nLinks\nSlides\nSource materials for the workshop on GitHub\nAcknowledgments\nOverview of color palettes drawn from “Which color scale to use when visualizing data” by Lisa Charlotte Muth\n\n\n\n",
    "preview": {},
    "last_modified": "2021-11-02T14:49:28-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-10-19-geospatial-visualizations-with-r/",
    "title": "Geospatial visualizations with R",
    "description": "R contains many different packages for importing, structuring, and visualizing geospatial datasets.\nIn this workshop we will consider two workflows for drawing geospatial data visualizations (aka data maps)\nusing pre-generated mapping tiles as well as spatial vector datasets. These methods integrate\ndirectly into tidy workflows and visualization methods such as `ggplot2`.",
    "author": [
      {
        "name": "Benjamin Soltoff",
        "url": "https://www.bensoltoff.com"
      }
    ],
    "date": "2021-10-19",
    "categories": [],
    "contents": "\nOverview\nR contains many different packages for importing, structuring, and visualizing geospatial datasets. In this workshop we will consider two workflows for drawing geospatial data visualizations (aka data maps). In the first method we will obtain pre-generated mapping tiles from sources such as Stamen Maps using the ggmap package. With the second method, we will use spatial data files which contain detailed information to draw all the components of a map (e.g. points, lines, polygons) using the simple features framework and the sf package. These methods integrate directly into tidy workflows and visualization methods such as ggplot2.\nObjectives\nIntroduce the major components of a geospatial visualization\nIdentify how to obtain map tiles using ggmap and get_map()\nGenerate plots overlaying data on raster map tiles\nDefine common data structures for storing spatial data objects\nImport spatial data using the sf package\nDraw maps using ggplot2 and geom_sf()\nChange coordinate systems\nAudience\nThis workshop is designed for individuals with a basic familiarity using R and ggplot2 for data visualization.\nLocation\nRoom 295 in 1155 E 60th St.\nPrework\nRegister for this workshop. Due to the current public health crisis, all participants must register in advance using this form.\nPlease sign up for a free RStudio Cloud account.\nIf you have not participated in a previous workshop meeting, join the workshop organization.\nLinks\nSource materials for the workshop on GitHub\nTo download these materials to your local computer, use the code below:\nusethis::use_course(\"css-skills/geospatial-viz\")\n\n\n\n",
    "preview": {},
    "last_modified": "2021-11-02T14:49:03-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-10-05-data-visualization-with-ggplot2/",
    "title": "Data visualization with ggplot2",
    "description": "An introduction to data visualization and the grammar of graphics in R.",
    "author": [
      {
        "name": "Benjamin Soltoff",
        "url": "https://www.bensoltoff.com"
      }
    ],
    "date": "2021-10-05",
    "categories": [],
    "contents": "\nData visualization with ggplot2\nOverview\nData visualizations are an important tool for communicating scientific findings. Visualizations encode empirical data in a compact and efficient form to help tell a story using your data. This workshop provides an introduction to creating statistical graphics using R and the ggplot2 package.\nObjectives\nProduce scatter plots, boxplots, and barplots using ggplot2\nOverlay multiple plot types on a single graph\nSet universal plot settings\nDescribe faceting (or small multiples plots) and apply faceting in ggplot2\nModify the aesthetics of an existing ggplot() plot\nBuild complex and customized plots from data in a data frame\nAudience\nThis workshop is designed for individuals with a basic familiarity using R and programmatic tools to conduct data analysis.\nLocation\nRoom 295 in 1155 E 60th St.\nPrework\nRegister for this workshop. Due to the current public health crisis, all participants must register in advance using this form.\nPlease sign up for a free RStudio Cloud account.\nOnce you have created your RStudio Cloud account, join the workshop organization.\nLinks\nSource materials for the workshop on GitHub\nTo download these materials to your local computer, use the code below:\nusethis::use_course(\"css-skills/dataviz\")\nAcknowledgments\nWorkshop materials are derived from R for Social Scientists licensed under Attribution 4.0 International (CC BY 4.0).\n\n\n\n",
    "preview": {},
    "last_modified": "2021-11-02T14:49:08-05:00",
    "input_file": {}
  }
]
